interface Comment {
    id: number;
  name: string;
  email: string;
  text: string;
}

export const MOCKSComment: Comment[] = [
  {
    id: 1,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
  {
    id: 2,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
  {
    id: 3,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
  {
    id: 4,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
  {
    id: 5,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
  {
    id: 6,
    name: "Полина",
    email: "polina@gmail.com",
    text: "Отличная статья,  но не хватает информации о том, как лучше реализовать на гридах более сложные конструкции, например, layout для интернет магазина",
  },
];
